apache/nuttx/arch/arm/src/xmc4/xmc4_spi.c
/****************************************************************************
 * arch/arm/src/xmc4/xmc4_spi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <assert.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/wdog.h>
#include <nuttx/kmalloc.h>
#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/spi/spi.h>

#include "arm_internal.h"
#include "chip.h"
#include "xmc4_gpio.h"
#include "xmc4_spi.h"
#include "xmc4_usic.h"
#include "hardware/xmc4_usic.h"
#include "hardware/xmc4_pinmux.h"

#if defined(CONFIG_XMC4_SPI0) || defined(CONFIG_XMC4_SPI1) || \
    defined(CONFIG_XMC4_SPI2) || defined(CONFIG_XMC4_SPI3) || \
    defined(CONFIG_XMC4_SPI4) || defined(CONFIG_XMC4_SPI5)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* When SPI DMA is enabled, small DMA transfers will still be performed by
 * polling logic.  But we need a threshold value to determine what is small.
 * That value is provided by CONFIG_XMC4_SPI_DMATHRESHOLD.
 */

#ifndef CONFIG_XMC4_SPI_DMATHRESHOLD
#  define CONFIG_XMC4_SPI_DMATHRESHOLD 4
#endif

#ifdef CONFIG_XMC4_SPI_DMA
#  if defined(CONFIG_XMC4_SPI0) && defined(CONFIG_XMC4_DMAC0)
#    define XMC4_SPI0_DMA true
#  else
#    define XMC4_SPI0_DMA false
#  endif
#  if defined(CONFIG_XMC4_SPI1) && defined(CONFIG_XMC4_DMAC1)
#    define XMC4_SPI1_DMA true
#  else
#    define XMC4_SPI1_DMA false
#  endif
#  if defined(CONFIG_XMC4_SPI2) && defined(CONFIG_XMC4_DMAC2)
#    define XMC4_SPI2_DMA true
#  else
#    define XMC4_SPI2_DMA false
#  endif
#  if defined(CONFIG_XMC4_SPI3) && defined(CONFIG_XMC4_DMAC3)
#    define XMC4_SPI3_DMA true
#  else
#    define XMC4_SPI3_DMA false
#  endif
#  if defined(CONFIG_XMC4_SPI4) && defined(CONFIG_XMC4_DMAC4)
#    define XMC4_SPI4_DMA true
#  else
#    define XMC4_SPI4_DMA false
#  endif
#  if defined(CONFIG_XMC4_SPI5) && defined(CONFIG_XMC4_DMAC5)
#    define XMC4_SPI5_DMA true
#  else
#    define XMC4_SPI5_DMA false
#  endif
#endif

#ifndef CONFIG_DEBUG_SPI_INFO
#  undef CONFIG_XMC4_SPI_REGDEBUG
#endif

#ifndef CONFIG_DEBUG_DMA_INFO
#  undef CONFIG_XMC4_SPI_DMADEBUG
#endif

/* Clocking *****************************************************************/

/* Select MCU-specific settings */

#if defined(CONFIG_ARCH_CHIP_XMC4)
#  define XMC4_SPI_CLOCK        BOARD_PERIPH_FREQUENCY /* Frequency of the
                                                        * clock */
#else
#  error Unrecognized XMC4xxx architecture
#endif

/* DMA timeout.  The value is not critical; we just don't want the system to
 * hang in the event that a DMA does not finish.  This is set to
 */

#define DMA_TIMEOUT_MS          (800)
#define DMA_TIMEOUT_TICKS       MSEC2TICK(DMA_TIMEOUT_MS)

#define XMC_SPI_OVERSAMPLING    (2UL)

/* Debug ******************************************************************
 * Check if SPI debut is enabled
 */

#ifndef CONFIG_DEBUG_DMA_INFO
#  undef CONFIG_XMC4_SPI_DMADEBUG
#endif

#define DMA_INITIAL         0
#define DMA_AFTER_SETUP     1
#define DMA_AFTER_START     2
#define DMA_CALLBACK        3
#define DMA_TIMEOUT         3
#define DMA_END_TRANSFER    4
#define DMA_NSAMPLES        5

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* The state of the one SPI chip select */

struct xmc4_spics_s
{
  struct spi_dev_s spidev;      /* Externally visible part of SPI interface */

  uint32_t frequency;           /* Requested clock frequency */
  uint8_t mode;                 /* Mode 0,1,2,3 */
  uint8_t nbits;                /* Width of word in bits (8 to 16) */
  uint8_t spino;                /* SPI controller number */
  uint8_t cs;                   /* Chip select number */

#ifdef CONFIG_XMC4_SPI_DMA
  bool candma;                  /* DMA is supported */
  sem_t dmawait;                /* Used to wait for DMA completion */
  struct wdog_s dmadog;         /* Watchdog that handles DMA timeouts */
  int result;                   /* DMA result */
  DMA_HANDLE rxdma;             /* SPI RX DMA handle */
  DMA_HANDLE txdma;             /* SPI TX DMA handle */
#endif

  /* Debug stuff */

#ifdef CONFIG_XMC4_SPI_DMADEBUG
  struct xmc4_dmaregs_s rxdmaregs[DMA_NSAMPLES];
  struct xmc4_dmaregs_s txdmaregs[DMA_NSAMPLES];
#endif
};

/* Type of board-specific SPI status function */

typedef void (*select_t)(struct spi_dev_s *dev, uint32_t devid,
                         bool selected);

/* Chip select register offsets */

/* The overall state of one SPI controller */

struct xmc4_spidev_s
{
  uint32_t base;                /* SPI controller register base address */
  mutex_t spilock;              /* Assures mutually exclusive access to SPI */
  select_t select;              /* SPI select call-out */
  bool initialized;             /* TRUE: Controller has been initialized */
#ifdef CONFIG_XMC4_SPI_DMA
  uint8_t rxintf;               /* RX hardware interface number */
  uint8_t txintf;               /* TX hardware interface number */
#endif

  uint8_t dx0;                /* Input signal selection for MISO */

