apache/nuttx/arch/arm/src/xmc4/xmc4_spi.c
  /* Debug stuff */

#ifdef CONFIG_XMC4_SPI_REGDEBUG
  bool wrlast;                  /* Last was a write */
  uint32_t addresslast;         /* Last address */
  uint32_t valuelast;           /* Last value */
  int ntimes;                   /* Number of times */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Helpers */

#ifdef CONFIG_XMC4_SPI_REGDEBUG
static bool     spi_checkreg(struct xmc4_spidev_s *spi, bool wr,
                             uint32_t value, uint32_t address);

#else
#  define       spi_checkreg(spi, wr, value, address)  (false)
#endif

static inline uint32_t spi_getreg(struct xmc4_spidev_s *spi,
                                  unsigned int offset);
static inline void spi_putreg(struct xmc4_spidev_s *spi, uint32_t value,
                              unsigned int offset);
static inline struct xmc4_spidev_s *spi_device(struct xmc4_spics_s *spics);

#ifdef CONFIG_DEBUG_SPI_INFO
static void     spi_dumpregs(struct xmc4_spidev_s *spi, const char *msg);
#else
#  define       spi_dumpregs(spi, msg)
#endif

static inline void spi_flush(struct xmc4_spidev_s *spi);

/* DMA support */

#ifdef CONFIG_XMC4_SPI_DMA

#ifdef CONFIG_XMC4_SPI_DMADEBUG
#  define spi_rxdma_sample(s, i) \
    xmc4_dmasample((s)->rxdma, &(s)->rxdmaregs[i])
#  define spi_txdma_sample(s, i) \
    xmc4_dmasample((s)->txdma, &(s)->txdmaregs[i])
static void     spi_dma_sampleinit(struct xmc4_spics_s *spics);
static void     spi_dma_sampledone(struct xmc4_spics_s *spics);

#else
#  define spi_rxdma_sample(s, i)
#  define spi_txdma_sample(s, i)
#  define spi_dma_sampleinit(s)
#  define spi_dma_sampledone(s)
#endif

static void     spi_rxcallback(DMA_HANDLE handle, void *arg, int result);
static void     spi_txcallback(DMA_HANDLE handle, void *arg, int result);
static inline uintptr_t spi_regaddr(struct xmc4_spics_s *spics,
                                    unsigned int offset);
#endif

/* SPI methods */

static int      spi_lock(struct spi_dev_s *dev, bool lock);
static void     spi_select(struct spi_dev_s *dev, uint32_t devid,
                           bool selected);
static uint32_t spi_setfrequency(struct spi_dev_s *dev, uint32_t frequency);
static void     spi_setmode(struct spi_dev_s *dev, enum spi_mode_e mode);
static void     spi_setbits(struct spi_dev_s *dev, int nbits);
static uint32_t spi_send(struct spi_dev_s *dev, uint32_t wd);

#ifdef CONFIG_XMC4_SPI_DMA
static void     spi_exchange_nodma(struct spi_dev_s *dev,
                                   const void *txbuffer, void *rxbuffer,
                                   size_t nwords);
#endif
static void     spi_exchange(struct spi_dev_s *dev, const void *txbuffer,
                             void *rxbuffer, size_t nwords);

#ifndef CONFIG_SPI_EXCHANGE
static void     spi_sndblock(struct spi_dev_s *dev, const void *buffer,
                             size_t nwords);
static void     spi_recvblock(struct spi_dev_s *dev, void *buffer,
                              size_t nwords);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_XMC4_SPI0
/* SPI0 driver operations */

static const struct spi_ops_s g_spi0ops =
{
  .lock         = spi_lock,
  .select       = spi_select,
  .setfrequency = spi_setfrequency,
  .setmode      = spi_setmode,
  .setbits      = spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures   = 0,                  /* Not supported */
#endif
  .status       = xmc4_spi0status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata      = xmc4_spi0cmddata,
#endif
  .send         = spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange     = spi_exchange,
#else
  .sndblock     = spi_sndblock,
  .recvblock    = spi_recvblock,
#endif
  .registercallback = 0,              /* Not implemented */
};

/* This is the overall state of the SPI0 controller */

static struct xmc4_spidev_s g_spi0dev =
{
  .base         = XMC4_USIC0_CH0_BASE,
  .spilock      = NXMUTEX_INITIALIZER,
  .select       = xmc4_spi0select,
#ifdef BOARD_SPI0_DX
  .dx0          = BOARD_SPI0_DX,
#else
  .dx0          = BOARD_SPI_DX,
#endif
#ifdef CONFIG_XMC4_SPI_DMA
  .rxintf       = DMACHAN_INTF_SPI0RX,
  .txintf       = DMACHAN_INTF_SPI0TX,
#endif
};
#endif

#ifdef CONFIG_XMC4_SPI1
/* SPI1 driver operations */

static const struct spi_ops_s g_spi1ops =
{
  .lock         = spi_lock,
  .select       = spi_select,
  .setfrequency = spi_setfrequency,
  .setmode      = spi_setmode,
  .setbits      = spi_setbits,
  .status       = xmc4_spi1status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata      = xmc4_spi1cmddata,
#endif
  .send         = spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange     = spi_exchange,
#else
  .sndblock     = spi_sndblock,
  .recvblock    = spi_recvblock,
#endif
  .registercallback = 0,              /* Not implemented */
};

/* This is the overall state of the SPI1 controller */

static struct xmc4_spidev_s g_spi1dev =
{
  .base         = XMC4_USIC0_CH1_BASE,
  .spilock      = NXMUTEX_INITIALIZER,
  .select       = xmc4_spi1select,
#ifdef BOARD_SPI1_DX
  .dx0          = BOARD_SPI1_DX,
#else
  .dx0          = BOARD_SPI_DX,
#endif
#ifdef CONFIG_XMC4_SPI_DMA
  .rxintf       = DMACHAN_INTF_SPI1RX,
  .txintf       = DMACHAN_INTF_SPI1TX,
#endif
};
#endif

#ifdef CONFIG_XMC4_SPI2
/* SPI1 driver operations */

static const struct spi_ops_s g_spi2ops =
{
  .lock         = spi_lock,
  .select       = spi_select,
  .setfrequency = spi_setfrequency,
  .setmode      = spi_setmode,
  .setbits      = spi_setbits,
  .status       = xmc4_spi2status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata      = xmc4_spi2cmddata,
#endif
  .send         = spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange     = spi_exchange,
#else
  .sndblock     = spi_sndblock,
  .recvblock    = spi_recvblock,
#endif
  .registercallback = 0,              /* Not implemented */
};

/* This is the overall state of the SPI2 controller */

static struct xmc4_spidev_s g_spi2dev =
{
  .base         = XMC4_USIC1_CH0_BASE,
  .spilock      = NXMUTEX_INITIALIZER,
  .select       = xmc4_spi2select,
#ifdef BOARD_SPI2_DX
  .dx0          = BOARD_SPI2_DX,
#else
  .dx0          = BOARD_SPI_DX,
#endif
#ifdef CONFIG_XMC4_SPI_DMA
  .rxintf       = DMACHAN_INTF_SPI2RX,
  .txintf       = DMACHAN_INTF_SPI2TX,
#endif
};
#endif

#ifdef CONFIG_XMC4_SPI3
/* SPI1 driver operations */

static const struct spi_ops_s g_spi3ops =
{
  .lock         = spi_lock,
  .select       = spi_select,
  .setfrequency = spi_setfrequency,
  .setmode      = spi_setmode,
  .setbits      = spi_setbits,
  .status       = xmc4_spi3status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata      = xmc4_spi3cmddata,
#endif
  .send         = spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange     = spi_exchange,
#else
  .sndblock     = spi_sndblock,
  .recvblock    = spi_recvblock,
#endif
  .registercallback = 0,              /* Not implemented */
};

/* This is the overall state of the SPI3 controller */

