apache/nuttx/arch/arm/src/xmc4/xmc4_spi.c
static struct xmc4_spidev_s g_spi3dev =
{
  .base         = XMC4_USIC1_CH1_BASE,
  .spilock      = NXMUTEX_INITIALIZER,
  .select       = xmc4_spi3select,
#ifdef BOARD_SPI3_DX
  .dx0          = BOARD_SPI3_DX,
#else
  .dx0          = BOARD_SPI_DX,
#endif
#ifdef CONFIG_XMC4_SPI_DMA
  .rxintf       = DMACHAN_INTF_SPI3RX,
  .txintf       = DMACHAN_INTF_SPI3TX,
#endif
};
#endif

#ifdef CONFIG_XMC4_SPI4
/* SPI1 driver operations */

static const struct spi_ops_s g_spi4ops =
{
  .lock         = spi_lock,
  .select       = spi_select,
  .setfrequency = spi_setfrequency,
  .setmode      = spi_setmode,
  .setbits      = spi_setbits,
  .status       = xmc4_spi4status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata      = xmc4_spi4cmddata,
#endif
  .send         = spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange     = spi_exchange,
#else
  .sndblock     = spi_sndblock,
  .recvblock    = spi_recvblock,
#endif
  .registercallback = 0,              /* Not implemented */
};

/* This is the overall state of the SPI4 controller */

static struct xmc4_spidev_s g_spi4dev =
{
  .base          = XMC4_USIC2_CH0_BASE,
  .spilock      = NXMUTEX_INITIALIZER,
  .select        = xmc4_spi4select,
#ifdef BOARD_SPI4_DX
  .dx0          = BOARD_SPI4_DX,
#else
  .dx0          = BOARD_SPI_DX,
#endif
#ifdef CONFIG_XMC4_SPI_DMA
  .rxintf        = DMACHAN_INTF_SPI4RX,
  .txintf        = DMACHAN_INTF_SPI4TX,
#endif
};
#endif

#ifdef CONFIG_XMC4_SPI5

/* SPI5 driver operations */

static const struct spi_ops_s g_spi5ops =
{
  .lock         = spi_lock,
  .select       = spi_select,
  .setfrequency = spi_setfrequency,
  .setmode      = spi_setmode,
  .setbits      = spi_setbits,
  .status       = xmc4_spi5status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata      = xmc4_spi5cmddata,
#endif
  .send         = spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange     = spi_exchange,
#else
  .sndblock     = spi_sndblock,
  .recvblock    = spi_recvblock,
#endif
  .registercallback = 0,              /* Not implemented */
};

/* This is the overall state of the SPI5 controller */

static struct xmc4_spidev_s g_spi5dev =
{
  .base         = XMC4_USIC2_CH1_BASE,
  .spilock      = NXMUTEX_INITIALIZER,
  .select       = xmc4_spi5select,
#ifdef BOARD_SPI5_DX
  .dx0          = BOARD_SPI5_DX,
#else
  .dx0          = BOARD_SPI_DX,
#endif
#ifdef CONFIG_XMC4_SPI_DMA
  .rxintf       = DMACHAN_INTF_SPI5RX,
  .txintf       = DMACHAN_INTF_SPI5TX,
#endif
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: spi_checkreg
 *
 * Description:
 *   Check if the current register access is a duplicate of the preceding.
 *
 * Input Parameters:
 *   value   - The value to be written
 *   address - The address of the register to write to
 *
 * Returned Value:
 *   true:  This is the first register access of this type.
 *   false: This is the same as the preceding register access.
 *
 ****************************************************************************/

#ifdef CONFIG_XMC4_SPI_REGDEBUG
static bool spi_checkreg(struct xmc4_spidev_s *spi, bool wr, uint32_t value,
                         uint32_t address)
{
  if (wr      == spi->wrlast &&     /* Same kind of access? */
      value   == spi->valuelast &&  /* Same value? */
      address == spi->addresslast)  /* Same address? */
    {
      /* Yes, then just keep a count of the number of times we did this. */

      spi->ntimes++;
      return false;
    }
  else
    {
      /* Did we do the previous operation more than once? */

      if (spi->ntimes > 0)
        {
          /* Yes... show how many times we did it */

          spiinfo("...[Repeats %d times]...\n", spi->ntimes);
        }

      /* Save information about the new access */

      spi->wrlast       = wr;
      spi->valuelast    = value;
      spi->addresslast  = address;
      spi->ntimes       = 0;
    }

  /* Return true if this is the first time that we have done this operation */

  return true;
}
#endif

/****************************************************************************
 * Name: spi_getreg
 *
 * Description:
 *  Read an SPI register
 *
 ****************************************************************************/

static inline uint32_t spi_getreg(struct xmc4_spidev_s *spi,
                                  unsigned int offset)
{
  uint32_t  address = spi->base + offset;
  uint32_t  value   = getreg32(address);

#ifdef CONFIG_XMC4_SPI_REGDEBUG
  if (spi_checkreg(spi, false, value, address))
    {
      spiinfo("%08x->%08x\n", address, value);
    }
#endif

  return value;
}

/****************************************************************************
 * Name: spi_putreg
 *
 * Description:
 *  Write a value to an SPI register
 *
 ****************************************************************************/

static inline void spi_putreg(struct xmc4_spidev_s *spi, uint32_t value,
                              unsigned int offset)
{
  uint32_t address = spi->base + offset;

#ifdef CONFIG_XMC4_SPI_REGDEBUG
  if (spi_checkreg(spi, true, value, address))
    {
      spiinfo("%08x<-%08x\n", address, value);
    }
#endif

  putreg32(value, address);
}

/****************************************************************************
 * Name: spi_dumpregs
 *
 * Description:
 *   Dump the contents of all SPI registers
 *
 * Input Parameters:
 *   spi - The SPI controller to dump
 *   msg - Message to print before the register data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_SPI_INFO
static void spi_dumpregs(struct xmc4_spidev_s *spi, const char *msg)
{
  spiinfo("%s:\n", msg);
  spiinfo("   KSCFG:%08x    FDR:%08x     BRG:%08x\n",
          getreg32(spi->base + XMC4_USIC_KSCFG_OFFSET),
          getreg32(spi->base + XMC4_USIC_FDR_OFFSET),
          getreg32(spi->base + XMC4_USIC_BRG_OFFSET));
  spiinfo("    INPR:%08x  DX0CR:%08x   DX1CR:%08x\n",
          getreg32(spi->base + XMC4_USIC_INPR_OFFSET),
          getreg32(spi->base + XMC4_USIC_DX0CR_OFFSET),
          getreg32(spi->base + XMC4_USIC_DX1CR_OFFSET));
  spiinfo("   DX2CR:%08x  DX3CR:%08x   DX4CR:%08x\n",
          getreg32(spi->base + XMC4_USIC_DX2CR_OFFSET),
          getreg32(spi->base + XMC4_USIC_DX3CR_OFFSET),
          getreg32(spi->base + XMC4_USIC_DX4CR_OFFSET));
  spiinfo("   DX5CR:%08x   SCTR:%08x    TCSR:%08x\n",
          getreg32(spi->base + XMC4_USIC_DX5CR_OFFSET),
          getreg32(spi->base + XMC4_USIC_SCTR_OFFSET),
          getreg32(spi->base + XMC4_USIC_TCSR_OFFSET));
  spiinfo("     PCR:%08x    CCR:%08x    CMTR:%08x\n",
          getreg32(spi->base + XMC4_USIC_PCR_OFFSET),
          getreg32(spi->base + XMC4_USIC_CCR_OFFSET),
          getreg32(spi->base + XMC4_USIC_CMTR_OFFSET));
  spiinfo("     PSR:%08x   PSCR:%08x  RBUFSR:%08x\n",
          getreg32(spi->base + XMC4_USIC_PSR_OFFSET),
          getreg32(spi->base + XMC4_USIC_PSCR_OFFSET),
          getreg32(spi->base + XMC4_USIC_RBUFSR_OFFSET));
  spiinfo("RBUF01SR:%08x    FMR:%08x   TRBSR:%08x\n",
          getreg32(spi->base + XMC4_USIC_RBUF01SR_OFFSET),
          getreg32(spi->base + XMC4_USIC_FMR_OFFSET),
          getreg32(spi->base + XMC4_USIC_TRBSR_OFFSET));
  spiinfo("   TBCTR:%08x  RBCTR:%08x  TRBPTR:%08x\n",
          getreg32(spi->base + XMC4_USIC_TBCTR_OFFSET),
          getreg32(spi->base + XMC4_USIC_RBCTR_OFFSET),
          getreg32(spi->base + XMC4_USIC_TRBPTR_OFFSET));
  spiinfo("   TRBSR:%08x TRBSCR:%08x   OUTDR:%08x\n",
          getreg32(spi->base + XMC4_USIC_TRBSR_OFFSET),
          getreg32(spi->base + XMC4_USIC_TRBSCR_OFFSET),
          getreg32(spi->base + XMC4_USIC_OUTDR_OFFSET));
}
#endif

/****************************************************************************
 * Name: spi_device
 *
 * Description:
 *    Given a chip select instance, return a pointer to the parent SPI
 *    controller instance.
 *
 ****************************************************************************/

static inline struct xmc4_spidev_s *spi_device(struct xmc4_spics_s *spics)
{
#if defined(CONFIG_XMC4_SPI0)
  if (spics->spino == 0)
    {
      return &g_spi0dev;
    }
#endif

#if defined(CONFIG_XMC4_SPI1)
  if (spics->spino == 1)
    {
      return &g_spi1dev;
    }
#endif

