apache/nuttx/arch/arm/src/xmc4/xmc4_spi.c
#if defined(CONFIG_XMC4_SPI2)
  if (spics->spino == 2)
    {
      return &g_spi2dev;
    }
#endif

#if defined(CONFIG_XMC4_SPI3)
  if (spics->spino == 3)
    {
      return &g_spi3dev;
    }
#endif

#if defined(CONFIG_XMC4_SPI4)
  if (spics->spino == 4)
    {
      return &g_spi4dev;
    }
#endif

#if defined(CONFIG_XMC4_SPI5)
  if (spics->spino == 5)
    {
      return &g_spi5dev;
    }
#endif

  /* Otherwise return NULL */

  return NULL;
}

/****************************************************************************
 * Name: spi_flush
 *
 * Description:
 *   Make sure that there are now dangling SPI transfer in progress
 *
 * Input Parameters:
 *   spi - SPI controller state
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void spi_flush(struct xmc4_spidev_s *spi)
{
  uint32_t regval;

  /* Wait for the transmit buffer/fifo to be "not full." */

  do
    {
      regval = getreg32(spi->base + XMC4_USIC_TCSR_OFFSET);
    }
  while ((regval & USIC_TCSR_TDV) != 0);
}

/****************************************************************************
 * Name: spi_dma_sampleinit
 *
 * Description:
 *   Initialize sampling of DMA registers (if CONFIG_XMC4_SPI_DMADEBUG)
 *
 * Input Parameters:
 *   spics - Chip select doing the DMA
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_XMC4_SPI_DMADEBUG
static void spi_dma_sampleinit(struct xmc4_spics_s *spics)
{
  /* Put contents of register samples into a known state */

  memset(spics->rxdmaregs, 0xff,
         DMA_NSAMPLES * sizeof(struct xmc4_dmaregs_s));
  memset(spics->txdmaregs, 0xff,
         DMA_NSAMPLES * sizeof(struct xmc4_dmaregs_s));

  /* Then get the initial samples */

  xmc4_dmasample(spics->rxdma, &spics->rxdmaregs[DMA_INITIAL]);
  xmc4_dmasample(spics->txdma, &spics->txdmaregs[DMA_INITIAL]);
}
#endif

/****************************************************************************
 * Name: spi_dma_sampledone
 *
 * Description:
 *   Dump sampled DMA registers
 *
 * Input Parameters:
 *   spics - Chip select doing the DMA
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_XMC4_SPI_DMADEBUG
static void spi_dma_sampledone(struct xmc4_spics_s *spics)
{
  /* Sample the final registers */

  xmc4_dmasample(spics->rxdma, &spics->rxdmaregs[DMA_END_TRANSFER]);
  xmc4_dmasample(spics->txdma, &spics->txdmaregs[DMA_END_TRANSFER]);

  /* Then dump the sampled DMA registers
   * Initial register values
   */

  xmc4_dmadump(spics->txdma, &spics->txdmaregs[DMA_INITIAL],
               "TX: Initial Registers");
  xmc4_dmadump(spics->rxdma, &spics->rxdmaregs[DMA_INITIAL],
               "RX: Initial Registers");

  /* Register values after DMA setup */

  xmc4_dmadump(spics->txdma, &spics->txdmaregs[DMA_AFTER_SETUP],
               "TX: After DMA Setup");
  xmc4_dmadump(spics->rxdma, &spics->rxdmaregs[DMA_AFTER_SETUP],
               "RX: After DMA Setup");

  /* Register values after DMA start */

  xmc4_dmadump(spics->txdma, &spics->txdmaregs[DMA_AFTER_START],
               "TX: After DMA Start");
  xmc4_dmadump(spics->rxdma, &spics->rxdmaregs[DMA_AFTER_START],
               "RX: After DMA Start");

  /* Register values at the time of the TX and RX DMA callbacks
   * -OR- DMA timeout.
   *
   * If the DMA timed out, then there will not be any RX DMA
   * callback samples.  There is probably no TX DMA callback
   * samples either, but we don't know for sure.
   */

  xmc4_dmadump(spics->txdma, &spics->txdmaregs[DMA_CALLBACK],
               "TX: At DMA callback");

  /* Register values at the end of the DMA */

  if (spics->result == -ETIMEDOUT)
    {
      xmc4_dmadump(spics->rxdma, &spics->rxdmaregs[DMA_TIMEOUT],
                   "RX: At DMA timeout");
    }
  else
    {
      xmc4_dmadump(spics->rxdma, &spics->rxdmaregs[DMA_CALLBACK],
                   "RX: At DMA callback");
    }

  xmc4_dmadump(spics->txdma, &spics->txdmaregs[DMA_END_TRANSFER],
               "TX: At End-of-Transfer");
  xmc4_dmadump(spics->rxdma, &spics->rxdmaregs[DMA_END_TRANSFER],
               "RX: At End-of-Transfer");
}
#endif

/****************************************************************************
 * Name: spi_dmatimeout
 *
 * Description:
 *   The watchdog timeout setup when a has expired without completion of a
 *   DMA.
 *
 * Input Parameters:
 *   arg  - The argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Always called from the interrupt level with interrupts disabled.
 *
 ****************************************************************************/

#ifdef CONFIG_XMC4_SPI_DMA
static void spi_dmatimeout(wdparm_t arg)
{
  struct xmc4_spics_s *spics = (struct xmc4_spics_s *)arg;

  DEBUGASSERT(spics != NULL);

  /* Sample DMA registers at the time of the timeout */

  spi_rxdma_sample(spics, DMA_CALLBACK);

  /* Report timeout result, perhaps overwriting any failure reports from
   * the TX callback.
   */

  spics->result = -ETIMEDOUT;

  /* Then wake up the waiting thread */

  nxsem_post(&spics->dmawait);
}
#endif

/****************************************************************************
 * Name: spi_rxcallback
 *
 * Description:
 *   This callback function is invoked at the completion of the SPI RX DMA.
 *
 * Input Parameters:
 *   handle - The DMA handler
 *   arg - A pointer to the chip select structure
 *   result - The result of the DMA transfer
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_XMC4_SPI_DMA
static void spi_rxcallback(DMA_HANDLE handle, void *arg, int result)
{
  struct xmc4_spics_s *spics = (struct xmc4_spics_s *)arg;

  DEBUGASSERT(spics != NULL);

  /* Cancel the watchdog timeout */

  wd_cancel(&spics->dmadog);

  /* Sample DMA registers at the time of the callback */

  spi_rxdma_sample(spics, DMA_CALLBACK);

  /* Report the result of the transfer only if the TX callback has not
   * already reported an error.
   */

  if (spics->result == -EBUSY)
    {
      /* Save the result of the transfer if no error previously reported */

      spics->result = result;
    }

  /* Then wake up the waiting thread */

  nxsem_post(&spics->dmawait);
}
#endif

/****************************************************************************
 * Name: spi_txcallback
 *
 * Description:
 *   This callback function is invoked at the completion of the SPI TX DMA.
 *
 * Input Parameters:
 *   handle - The DMA handler
 *   arg    - A pointer to the chip select structure
 *   result - The result of the DMA transfer
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_XMC4_SPI_DMA
static void spi_txcallback(DMA_HANDLE handle, void *arg, int result)
{
  struct xmc4_spics_s *spics = (struct xmc4_spics_s *)arg;

  DEBUGASSERT(spics != NULL);

  spi_txdma_sample(spics, DMA_CALLBACK);

  /* Do nothing on the TX callback unless an error is reported.  This
   * callback is not really important because the SPI exchange is not
   * complete until the RX callback is received.
   */

  if (result != OK && spics->result == -EBUSY)
    {
      /* Save the result of the transfer if an error is reported */

      spics->result = result;
    }
}
#endif

/****************************************************************************
 * Name: spi_regaddr
 *
 * Description:
 *   Return the address of an SPI register
 *
 ****************************************************************************/

#ifdef CONFIG_XMC4_SPI_DMA
static inline uintptr_t spi_regaddr(struct xmc4_spics_s *spics,
                                    unsigned int offset)
{
  struct xmc4_spidev_s *spi = spi_device(spics);

  return spi->base + offset;
}
#endif

/****************************************************************************
 * Name: spi_lock
 *
 * Description:
 *   On SPI buses where there are multiple devices, it will be necessary to
 *   lock SPI to have exclusive access to the buses for a sequence of
 *   transfers.  The bus should be locked before the chip is selected. After
 *   locking the SPI bus, the caller should then also call the setfrequency,
 *   setbits, and setmode methods to make sure that the SPI is properly
 *   configured for the device.  If the SPI bus is being shared, then it
 *   may have been left in an incompatible state.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   lock - true: Lock spi bus, false: unlock SPI bus
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

