apache/nuttx/arch/arm/src/xmc4/xmc4_spi.c
  /* Select the SPI operations */

#if defined(CONFIG_XMC4_SPI0)
  if (spino == 0)
    {
      spics->spidev.ops = &g_spi0ops;
    }
  else
#endif
#if defined(CONFIG_XMC4_SPI1)
  if (spino == 1)
    {
      spics->spidev.ops = &g_spi1ops;
    }
  else
#endif
#if defined(CONFIG_XMC4_SPI2)
  if (spino == 2)
    {
      spics->spidev.ops = &g_spi2ops;
    }
  else
#endif
#if defined(CONFIG_XMC4_SPI3)
  if (spino == 3)
    {
      spics->spidev.ops = &g_spi3ops;
    }
  else
#endif
#if defined(CONFIG_XMC4_SPI4)
  if (spino == 4)
    {
      spics->spidev.ops = &g_spi4ops;
    }
  else
#endif
#if defined(CONFIG_XMC4_SPI5)
  if (spino == 5)
    {
      spics->spidev.ops = &g_spi5ops;
    }
  else
#endif
    {
      spierr("ERROR:  spino invalid: %d\n", spino);
    }

  /* Save the chip select and SPI controller numbers */

  /* spics->cs    = csno; */

  spics->cs     = 0;
  spics->spino  = spino;

  /* Set to mode=0 and nbits=8 and impossible frequency. The SPI will only
   * be reconfigured if there is a change.
   */

  spics->nbits = 8;

  /* Get the SPI device structure associated with the chip select */

  spi = spi_device(spics);

  /* Has the SPI hardware been initialized? */

  if (!spi->initialized)
    {
      /* Enable clocking to the SPI block */

      flags = enter_critical_section();

      /* Enable the USIC channel */

      ret = xmc4_enable_usic_channel(channel);
      if (ret < 0)
        {
          spierr("ERROR: Failed to enable USIC channel!\n");
          goto errchannel;
        }

#if defined(CONFIG_XMC4_SPI0)
      if (spino == 0)
        {
          /* Configure multiplexed pins as connected on the board.  Chip
           * select pins must be selected by board-specific logic.
           */

          xmc4_gpio_config(GPIO_SPI0_MISO);
          xmc4_gpio_config(GPIO_SPI0_MOSI);
          xmc4_gpio_config(GPIO_SPI0_SCLK);
        }
      else
#endif
#if defined(CONFIG_XMC4_SPI1)
      if (spino == 1)
        {
          /* Configure multiplexed pins as connected on the board.  Chip
           * select pins must be selected by board-specific logic.
           */

          xmc4_gpio_config(GPIO_SPI1_MISO);
          xmc4_gpio_config(GPIO_SPI1_MOSI);
          xmc4_gpio_config(GPIO_SPI1_SCLK);
        }
      else
#endif
#if defined(CONFIG_XMC4_SPI2)
      if (spino == 2)
        {
          /* Configure multiplexed pins as connected on the board.  Chip
           * select pins must be selected by board-specific logic.
           */

          xmc4_gpio_config(GPIO_SPI2_MISO);
          xmc4_gpio_config(GPIO_SPI2_MOSI);
          xmc4_gpio_config(GPIO_SPI2_SCLK);
        }
      else
#endif
#if defined(CONFIG_XMC4_SPI3)
      if (spino == 3)
        {
          /* Configure multiplexed pins as connected on the board.  Chip
           * select pins must be selected by board-specific logic.
           */

          xmc4_gpio_config(GPIO_SPI3_MISO);
          xmc4_gpio_config(GPIO_SPI3_MOSI);
          xmc4_gpio_config(GPIO_SPI3_SCLK);
        }
      else
#endif
#if defined(CONFIG_XMC4_SPI4)
      if (spino == 4)
        {
          /* Configure multiplexed pins as connected on the board.  Chip
           * select pins must be selected by board-specific logic.
           */

          xmc4_gpio_config(GPIO_SPI4_MISO);
          xmc4_gpio_config(GPIO_SPI4_MOSI);
          xmc4_gpio_config(GPIO_SPI4_SCLK);
        }
      else
#endif
#if defined(CONFIG_XMC4_SPI5)
      if (spino == 5)
        {
          /* Configure multiplexed pins as connected on the board.  Chip
           * select pins must be selected by board-specific logic.
           */

          xmc4_gpio_config(GPIO_SPI5_MISO);
          xmc4_gpio_config(GPIO_SPI5_MOSI);
          xmc4_gpio_config(GPIO_SPI5_SCLK);
        }
      else
#endif
        {
          spierr("ERROR:  spino invalid: %d\n", spino);
        }

      /* Leave critical section */

      leave_critical_section(flags);

      /* Set initial clock to 1MHz */

      ret = xmc4_usic_baudrate(channel, 1000000, XMC_SPI_OVERSAMPLING);
      if (ret < 0)
        {
          spierr("Setting initial clock failed!\n");
          goto errchannel;
        }

      /* Set DX0CR input source path and input switch */

      if (spi->dx0 > 7)
        {
          spierr("ERROR:  DX invalid: %d\n", spi->dx0);
          goto errchannel;
        }

      regval  = getreg32(spi->base + XMC4_USIC_DX0CR_OFFSET);
      regval &= ~USIC_DXCR_DSEL_MASK;
      regval |= USIC_DXCR_DSEL_DX(spi->dx0);
      regval |= USIC_DXCR_INSW;
      putreg32(regval, spi->base + XMC4_USIC_DX0CR_OFFSET);

      /* Configuration of USIC Shift Control
       * Transmission Mode (TRM)  = 1
       * Passive Data Level (PDL) = 1
       * Serial Direction MSB (SDIR) = 1
       */

      regval = USIC_SCTR_PDL1 | USIC_SCTR_TRM_1LEVEL | USIC_SCTR_SDIR |
               USIC_SCTR_FLE(64) | USIC_SCTR_WLE(spics->nbits);
      spi_putreg(spi, regval, XMC4_USIC_SCTR_OFFSET);

      /* Configuration of USIC Transmit Control/Status Register
       * TBUF Data Enable (TDEN) = 1
       * TBUF Data Single Shot Mode (TDSSM) = 1
       */

      regval = USIC_TCSR_HPCMD | USIC_TCSR_TDEN_TDIV | USIC_TCSR_TDSSM;
      spi_putreg(spi, regval, XMC4_USIC_TCSR_OFFSET);

      /* Configuration of Protocol Control Register */

      regval = USIC_PCR_SSCMODE_MSLSEN | USIC_PCR_SSCMODE_SELCTR |
               USIC_PCR_SSCMODE_FEM | USIC_PCR_SSCMODE_SELINV;
      spi_putreg(spi, regval, XMC4_USIC_PCR_OFFSET);

      /* Define SPI Mode 0 by default */

      regval  = spi_getreg(spi, XMC4_USIC_BRG_OFFSET);
      regval &= ~(USIC_BRG_SCLKCFG_MASK);
      regval |= XMC4_SPI_MODE0;
      spi_putreg(spi, regval, XMC4_USIC_BRG_OFFSET);

      /* Clear protocol status */

      spi_putreg(spi, 0xfffffffful, XMC4_USIC_PSCR_OFFSET);

      /* Disable the parity */

      spi_putreg(spi, 0, XMC4_USIC_CCR_OFFSET);

      spi->initialized = true;

#ifdef CONFIG_XMC4_SPI_DMA
      nxsem_init(&spics->dmawait, 0, 0);
#endif

      spi_dumpregs(spi, "After initialization");
    }

  return &spics->spidev;

errchannel:
  kmm_free(spics);
  return NULL;
}
#endif /* CONFIG_XMC4_SPI0 || CONFIG_XMC4_SPI1 */
